import React from "react";
import NavBar from "../components/NavBar";
import Imagedino from "../assets/depositphotos_200973024-stock-illustration-realistic-graphic-dinosaur.jpg";
import Imageweather from "../assets/weather.jpg"
import Imageemo from "../assets/emo.jpg"

function News(){
    const texth = {
        padding: '0px 0px 0px 30px'
    }
    const text = {
        display: 'flex',
        padding: '0px 50px 0px 50px'
      };
    return (
        <>
            <NavBar />
            <h1 style={{marginLeft: "20px"}}>Сьогоднішні новинни</h1>
            <hr />
            <div >
            <h2 style={texth}>Дослідники знайшли секретний острів, де ще живуть динозаври</h2>
            <div style={text}><h4>  У захоплюючій розробці, вчені з Інституту екологічних досліджень оголосили про неймовірне відкриття – секретний острів, де динозаври не просто існують, але і процвітають. Острів, який був виявлений за допомогою супутникових знімків і новітніх технологій, знаходиться у віддаленому куточку Тихого океану, недоступному для звичайних подорожніх.

Розвідувальна експедиція, що вирушила на цей острів, виявила доказ того, що динозаври не тільки вижили, але й адаптувались до сучасного середовища. “Ми знайшли вражаючі сліди динозаврів, залишені на узбережжі”, – сказав доктор Елізабета Вонг, провідний дослідник проекту. “Крім того, ми бачили реальні живі динозаври, які виглядають точно так, як їхні предки на малюнках і в фільмах”.

Острів виглядає як справжній тропічний рай, але з додатковою особливістю – динозаврами. Вчені вважають, що ізольований острів забезпечив ідеальні умови для їхнього виживання. Експедиція вже планує продовжити дослідження, щоб з’ясувати, як ці істоти адаптувалися і як вони взаємодіють один з одним.

Новина про цей острів викликала великий ажіотаж серед науки і публіки. Експерти запевняють, що це відкриття може мати величезне значення для нашого розуміння еволюції та біорізноманіття.</h4> <img src={Imagedino} alt="" style={{ width: '300px', height: 'auto', marginRight: '20px', marginLeft: "50px" }}/></div>
            <h2 style={texth}>Вчені виявили спосіб контролювати погоду за допомогою нової технології</h2>
            <div style={text}><h4>Вчені з Університету Кліматичних Інновацій оголосили про революційний прорив у контролі над погодою. Нова технологія, названа “Атмосферний Регіонатор”, дозволяє змінювати погодні умови на великих територіях за допомогою високочастотних хвиль.

Розробка базується на принципах, що раніше були теоретичними, але тепер вдалося реалізувати їх на практиці. Технологія використовує спеціальні пристрої, розміщені на супутниках, які випромінюють хвилі, здатні впливати на атмосферні умови. Це дозволяє не лише викликати дощ або посуху, а й контролювати температуру і швидкість вітру.

“Ця технологія може змінити спосіб, яким ми справляємось із кліматичними катастрофами,” – пояснює доктор Марк Хенсон, керівник проекту. “Ми можемо попередити сухові сезони, забезпечити воду для посівів і навіть допомогти в боротьбі з екстремальними погодними явищами”.

Технологія вже пройшла початкові випробування на обмежених територіях, де результати були вражаючими. Науковці планують подальші дослідження та вдосконалення, щоб забезпечити точність і безпеку застосування цієї технології на глобальному рівні.

Застосування таких інновацій може мати значний вплив на агрономію, екологію та людське життя в цілому, але викликає також питання про етичні та екологічні наслідки.</h4><img src={Imageweather} alt="" style={{ width: '300px', height: 'auto', marginRight: '20px', marginLeft: "50px"}}/></div>
        <h2 style={texth}>Новий тренд: люди починають спілкуватися з допомогою мови емоцій</h2>
        <div style={text}><h4>У світі комунікацій з’явилася нова мода – мова емоцій. Інноваційний метод дозволяє людям спілкуватися між собою за допомогою виразу емоцій замість традиційних слів. Розроблений командою психологів і технологів, цей метод базується на передових дослідженнях в області нейролінгвістичного програмування і штучного інтелекту.

Мова емоцій використовує спеціальні пристрої, що зчитують емоційний стан користувача і передають його в реальному часі через електронні канали. Замість слів люди тепер можуть передавати свої почуття, використовуючи кольорові сигнали і візуальні символи.

“Ця технологія дозволяє значно покращити наше спілкування,” – стверджує доктор Ірина Громова, один з розробників методу. “Вона зменшує кількість непорозумінь і допомагає краще зрозуміти один одного”.

Тренд вже набирає популярність серед молоді і в соціальних мережах, де люди активно використовують мову емоцій для вираження своїх думок і почуттів. Психологи відзначають, що це може зменшити стрес і поліпшити емоційний клімат у соціальних взаємодіях.

Новий тренд має потенціал змінити спосіб, яким ми спілкуємося, і може стати важливим кроком до більш глибокого і чесного взаєморозуміння.</h4><img src={Imageemo} alt="" style={{ width: '300px', height: 'auto', marginRight: '20px', marginBottom: '30px', marginLeft: "50px"}}/></div>
        </div>
        <div></div>
        </>
    )
}

export default News;